identification division.
program-id. GraceHopper.
*> Author: Sean McBride

procedure division.

display "                     __..````..__                      " end-display.
display "                 ._--```   ,.   ```--_.                 " end-display.
display "               //``      << `)      ``\\               " end-display.
display "              ..    ..--../  \..--..   ..              " end-display.
display "              ||   /``-\__    __/-``\  ||              " end-display.
display "        .---  ||  *   ____\__/____  *  ||   ---.       " end-display.
display "      /`      ||    `==============`   ||       `\     " end-display.
display "    ./        ||    |==============|   ||         \.   " end-display.
display " ,  |   ,=====||    |     NAVY     |   ||=====,    |  ," end-display.
display " /\,,, //\\\\\||     \     **     /    ||//////\\ ,,,/\" end-display.
display "|/////---,,\\\||      \,.______,./     ||///,,---\\\\\\|" end-display.
display "|//////////;..__     ++_        _++    __..;\\\\\\\\\\\|" end-display.
display "|///////////////``\      `----`     /``\\\\\\\\\\\\\\\\|" end-display.
display "|///////////////////````..____..````\\\\\\\\\\\\\\\\\\\|" end-display.
display "|///////////////.../////////\\\\\\\\...\\\\\\\\\\\\\\\\|" end-display.
display "|/////////..--``                       ``--..\\\\\\\\\\|" end-display.
display ".////../``                                    ``\..\\\\." end-display.
display "\///``                                            ``\\\/" end-display.
display " \                                                    / " end-display.
display "                                                        " end-display.
display "       -----------------,      ,-----------------       " end-display.
display "     /\\\,.``````````````\____/ `````````````.,///\     " end-display.
display "     (\\/                \.--./                \//)     " end-display.
display "      /                  /    \                  \      " end-display.
display "       \\               //    \\               //       " end-display.
display "        \\             //      \\             //        " end-display.
display "         \\           //        \\           //         " end-display.
display "          `,=========`            `=========,`          " end-display.
display "                                                        " end-display.
display "                                                        " end-display.
stop run.
