identification division.
program-id. GraceHopper.
author.     Sean McBride.

procedure division.

display "                     __..````..__                      ".
display "                 ._--```   ,.   ```--_.                 ".
display "               //``      << `)      ``\\               ".
display "              ..    ..--../  \..--..   ..              ".
display "              ||   /``-\__    __/-``\  ||              ".
display "        .---  ||  *   ____\__/____  *  ||   ---.       ".
display "      /`      ||    `==============`   ||       `\     ".
display "    ./        ||    |==============|   ||         \.   ".
display " ,  |   ,=====||    |     NAVY     |   ||=====,    |  ,".
display " /\,,, //\\\\\||     \     **     /    ||//////\\ ,,,/\".
display "|/////---,,\\\||      \,.______,./     ||///,,---\\\\\\|".
display "|//////////;..__     ++_        _++    __..;\\\\\\\\\\\|".
display "|///////////////``\      `----`     /``\\\\\\\\\\\\\\\\|".
display "|///////////////////````..____..````\\\\\\\\\\\\\\\\\\\|".
display "|///////////////.../////////\\\\\\\\...\\\\\\\\\\\\\\\\|".
display "|/////////..--``                       ``--..\\\\\\\\\\|".
display ".////../``                                    ``\..\\\\.".
display "\///``                                            ``\\\/".
display " \                                                    / ".
display "                                                        ".
display "       -----------------,      ,-----------------       ".
display "     /\\\,.``````````````\____/ `````````````.,///\     ".
display "     (\\/                \.--./                \//)     ".
display "      /                  /    \                  \      ".
display "       \\               //    \\               //       ".
display "        \\             //      \\             //        ".
display "         \\           //        \\           //         ".
display "          `,=========`            `=========,`          ".
display "                                                        ".
display "                                                        ".
