000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO.
000300 PROCEDURE DIVISION.
000250* This is an example of traditional structured COBOL
000350 A000-FIRST-PARA.
000400     DISPLAY "Coding Sheet" END-DISPLAY.
000450     DISPLAY "This is a really really long line that requires cont
000460-            "inuation across several lines. Doesn't this look pre
000470-            "tty crazy?" END-DISPLAY.
000500 STOP RUN.
