000100 IDENTIFICATION DIVISION.                                         000100
000200 PROGRAM-ID. HELLO.                                               000101
000300 PROCEDURE DIVISION.                                              000103
000250* This is an example of traditional structured COBOL              000102
000350 A000-FIRST-PARA.                                                 000104
000400     DISPLAY "Coding Sheet".                                      000105
000450     DISPLAY "This is a really really long line that requires cont 
000460-            "inuation across several lines. Doesn't this look pre
000470-            "tty crazy?"
000500 STOP RUN.                                                        000106
